{"video_id": "", "sku": "100001901", "video_cover": "", "author_name": "徐飞", "text_read_version": 0, "audio_size": 4795218, "article_cover": "https://static001.geekbang.org/resource/image/35/6d/35a27554b8f154909b2a43ef526f6a6d.jpg", "product_type": "c1", "audio_url": "https://res001.geekbang.org/media/audio/43/89/433e779e12b5b90e09834fca190c9089/ld.m3u8", "chapter_id": "0", "column_had_sub": true, "audio_dubber": "秭明", "is_finished": true, "neighbors": {"left": {"article_title": "002 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（下）", "id": 39}, "right": {"article_title": "004 | 可视化分析鼻祖Tableau", "id": 415}}, "product_id": 100001901, "video_height": 0, "rate_percent": 100, "article_content": "<p>前面说到微软推出Windows Media Player，利用一贯的免费加捆绑策略杀入媒体领域，开始抢占RealNetworks的市场。与此同时，苹果的QuickTime也同样采用了免费的竞争策略。而你是否已经站在当初格拉泽的角度，考虑了自己的应对策略呢？</p>\n<p>今天，我就先来和你说一说RealNetworks公司在产品或市场遭遇商业巨鳄挤占或阻击时，所采取的应对举措。</p>\n<!-- [[[read_end]]] -->\n<p>RealNetworks遇到了大多数创业公司都会遇到的一个非常典型的问题：产品做得好，却被大鳄盯上了。大鳄来势汹汹，初创公司应该怎么办？这个问题没有固定的答案，有些对策在一个案例里面成功了，但在另外一个案例里面却可能失败。</p>\n<p>对于各种事件，我们很容易“事后诸葛”地进行分析，但只有当事人才能在那个局面里做出决定。我从未经历过这样的时刻，因此也只能“事后诸葛”一回。</p>\n<p><b>一家公司是否具备了应对商业巨鳄挤占或者阻击的资格，首先取决于这家公司的产品有没有不可替代性。</b>如果这家公司的产品没有不可替代性，那么面对商业巨鳄，特别是当这家巨鳄本身能从自己的其他业务赚钱，补贴给替代产品，不需要通过替代产品盈利时，在烧钱这件事上，初创公司是不可能烧得过商业巨鳄的。</p>\n<p>以RealNetworks为例，其产品在技术上比微软或者苹果的同类产品要好，但是这种好对于大部分用户来说，并非是不可替代的。如果竞争对手使用低价乃至免费倾销的策略，用户很多时候愿意免费使用体验相对次一些的产品。这在RealNetworks的经历中就有体现：面对需要付费的服务器，用户更愿意尝试质量虽然差一些，但却免费的服务器。</p>\n<p>换一个例子来看，当谷歌大举进军社交领域的时候，Facebook一开始是非常紧张的。然而，谷歌在社交领域的攻城略地却显得非常失败。</p>\n<p>实际上，这很容易理解：一个人的好友如果都在Facebook上了，再让这个人迁移出即有的社交圈，转而使用另外一个社交软件，其代价是巨大的，此事甚至是不切实际的。所以，在Facebook巩固了很多著名的高校社交圈之后，它就在很多人那里成为了一个不可替代的平台。和竞争对手比起来，这种优势是一家公司得以生存和发展的关键。</p>\n<p>如果说，初创公司意识到了自己的核心产品并没有具备不可替代的特性，那么面对商业巨鳄的阻击，又应该怎么办呢？</p>\n<p>RealNetworks采取了一系列的应对措施，概括来说就是：<b>在自己比对方更擅长的相关领域开展业务，扩展战线。</b></p>\n<p>RealNetworks的创始人自己就来自微软，他深知一旦微软盯上了一款软件并推出免费产品，正面反击会异常艰难。自身软件的特性固然比对方的要好，但绝没好到不可替代的程度。所以RealNetworks选择以播放器作为切入点，成为内容服务商。</p>\n<p>RealNetworks认为，和自己比起来，微软作为传统软件大厂商，在做内容和服务这一块更加没有经验。所以一场战争如果延续到了相关的领域，而在相关领域里自己比大鳄更加得有优势，那么凭借软件开辟出来的先发优势，就有可能让自己站稳脚跟。</p>\n<p>实际上，我想从一开始创业，到后来微软跳出来的种种变局，所有的策略，格拉泽在创立公司伊始应该就想过无数遍。这是他成功的关键。</p>\n<p>我们还可以看到另外一种选择：<b>面对大鳄的袭击，抱上另外一个大腿也不错。大腿和大鳄有竞争关系，但却往往对初创公司的产业或者产品兴趣不大。</b>只是，有大腿可以抱，本身就不容易。很多时候，初创公司找不到合适的大腿去抱；更何况，即便初创公司能找到合适的大腿，大腿还得看得上自己。两者加起来，能够抱上大腿的初创公司终究是少数。所以这也只能说是一种运气。</p>\n<p>然而在第二篇文章中，我们却也看到了令人唏嘘不已的事情：具备各种强烈优势背景的RealNetworks开始一一败退，并沦落到如今籍籍无名的地步。文末，我同样给你抛出了一个问题：你觉得这是战略、创始人的眼界问题，还是公司大势已去？相信你的思考一定很精彩。</p>\n<p>为什么RealNetworks没能抓住时代的变革，反而成全了苹果？这个故事告诉我们一个道理，<b>站在行业变革的前夜，唯有伟人才能够比别人看得更远</b>。史蒂夫 · 乔布斯去世的时候，各大互联网公司都在自己的首页向这位伟人致敬。我想，这种崇敬是发自内心的，因为大家看到了一个可以比他人更早几年看到行业变迁的伟人。可惜，不是每个人都是乔布斯。你我不是，格拉泽也不是。</p>\n<p>RealNetworks其实算得上是一步错步步错。格拉泽在技术上当然是有几把刷子的，他在出来创业前，也想明白了要面对的对手多半是自己的老东家微软。因为在老东家工作多年，所以估计也想明白了比尔 · 盖茨的套路，知道怎么去应对才能让自己的公司发展下去。</p>\n<p>然而我们也必须说，作为一个很不错的创业者，格拉泽应该不具备比尔 · 盖茨对于PC软件的认识，或者乔布斯对于消费电子的认识。因此当一个全新的东西出来时，他就迷茫了。那个大硬盘播放器的东西，就让格拉泽迷茫了。</p>\n<p>其实不仅仅是格拉泽迷茫了，当iPhone出来的时候，微软CEO鲍尔默看着这个没有按键的手机，也迷茫了，觉得这是个手机吗？</p>\n<p>鲍尔默曾经很有信心赢得智能手机这场战争，投入巨资做Windows Phone，不惜购买诺基亚。然而不出几年，所谓的Windows Phone终究是被市场淘汰，最后被微软的新CEO萨提亚放弃了。我们是不是就此可以责怪鲍尔默呢？其实，鲍尔默做企业级软件的能力和实力，是得到业界公认的。但是这次他没看明白iPhone的影响力，在面对这样一次巨大的变革时，没能做出正确的判断。</p>\n<p>所以在我看来，iPod的这个变革和变革后面的影响确实非常大。RealNetworks在成为媒体大亨之后没多久，就要面对iPod这种革命性产品的变革，格拉泽真的是运气不太好。那个时间点，若换作张三李四王五，乃至比尔 · 盖茨，是不是就会做得比格拉泽更好呢？我看也不一定。</p>\n<p>所以iPod的原型机诞生在RealNetworks，而格拉泽却拒绝了这个创意，既在意料之外，也在情理之中。我想，我们不应该单就这个东西质疑格拉泽太多。所谓时也运也，大致也就是这个道理。</p>\n<p>抛开iPod被格拉泽拱手相让这个事实不说，进一步思考RealNetworks的发展，你会发现更加有意思的地方。YouTube这样的免费视频分享网站，并没有在RealNetworks这个当时的媒体大鳄下面诞生或壮大，而这个媒体大鳄在那个时候却进入广告市场，并采取了非常激进的广告投放策略，哪怕影响用户体验也在所不惜。</p>\n<p>后面两件事情放在一起，首先说明RealNetworks在那个时候是有盈利压力的。盈利压力一方面缘于它本身是上市公司，所以需要给投资者看到自己赚钱的能力，一方面我想也和互联网泡沫破灭以后的大环境相关。这个大环境下，免费的东西不被投资人看好。因此，这对已经上市的公司，尤其是面临盈利压力的上市公司就形成了阻力。</p>\n<p>但是不管怎样，这方面我觉得格拉泽做得和亚马逊的总裁贝佐斯比起来要差得多。<b>贝佐斯在他的领导力准则里面强调，公司的领导人应该旨在实现长远的目标，而不应该屈从于短期的利益。</b>一家为了盈利而非常激进地投放广告，不顾用户体验的公司，怎么可能去支持一个短期内没有盈利希望的、类似于YouTube这样的视频分享网站呢？</p>\n<p>从这一点我们可以看出，作为创业者的格拉泽，在技术上有其独到的地方，在商业上，也对微软的介入做了充分准备。但是，他毕竟不是一个目光长远的伟人，无法在短期盈利和长期发展之间找到合适的平衡点。如果你承认了格拉泽在这方面的缺陷，也就可以理解为什么类似YouTube的视频分享网站无法从媒体公司RealNetworks里诞生了。</p>\n<p>而当iPod开始逐渐侵占RealNetworks的基本盘时，格拉泽选择游走于灰色地带，并让自家的媒体登上iPod的做法，那就不仅仅是眼光的问题了。格拉泽明显是顶不住压力才出此险招。而此险招是否曾在内部遭遇抵制已不得而知，但其终归是被RealNetworks整个高管团队通过，并最终实施。</p>\n<p><b>更重要的是，RealNetworks当时居然没有意识到iPod的胜利其实就是一个平台的胜利。而战胜平台，唯一的办法就是建设自己的平台。</b>RealNetworks已经有了足够多的内容，建设自己的平台肯定比让自己的内容以不怎么合法的方式进入别人的平台来得更有效也更安全。我实在是无法理解格拉泽为什么选择了这样的一个应对方式。我只能说，一个人的英明是有限的。格拉泽也不能免俗。</p>\n<p></p>\n", "footer_cover_data": {"img_url": "https://static001.geekbang.org/resource/image/2d/8b/2de2db52ee03f508e0d240822f31808b.png", "link_url": "", "mp_url": ""}, "column_is_experience": false, "video_size": 0, "article_cover_hidden": false, "is_required": true, "rate": {"2": {"cur_version": 1574396676, "max_rate": 599, "cur_rate": 599, "is_finished": true, "total_rate": 599, "learned_seconds": 0}, "1": {"cur_version": 1546906874, "max_rate": 0, "cur_rate": 0, "is_finished": true, "total_rate": 0, "learned_seconds": 0}, "3": {"cur_version": 0, "max_rate": 0, "cur_rate": 0, "is_finished": false, "total_rate": 0, "learned_seconds": 0}}, "score": "1507590000123", "view_count": 7809, "audio_download_url": "https://static001.geekbang.org/resource/audio/43/89/433e779e12b5b90e09834fca190c9089.mp3", "id": 314, "had_viewed": true, "article_title": "003 | 以RealNetworks为例，谈谈初创公司如何应对巨头碾压", "column_bgcolor": "#d1bd97", "like_count": 35, "had_liked": false, "is_video_preview": false, "article_summary": "微软利用一贯的“免费加捆绑”策略杀入媒体领域，苹果也带着QuickTime\b进入竞争\b行列，RealNetworks公司又将采取哪些应对举措呢？", "article_features": 0, "article_could_preview": false, "column_cover": "https://static001.geekbang.org/resource/image/1a/5d/1a32306e4af4c76efdaed3f244136a5d.jpg", "audio_time_arr": {"m": "09", "s": "59", "h": "00"}, "column_id": 42, "audio_time": "00:09:59", "article_sharetitle": "以RealNetworks为例，谈谈初创公司如何应对巨头碾压", "audio_title": "003-1 1", "audio_md5": "433e779e12b5b90e09834fca190c9089", "text_read_percent": 0, "article_subtitle": "无", "cid": 42, "video_time": "", "article_cshort": "<p>前面说到微软推出Windows Media Player，利用一贯的免费加捆绑策略杀入媒体领域，开始抢占RealNetworks的市场。与此同时，苹果的QuickTime也同样采用了免费的竞争策略。而你是否已经站在当初格拉泽的角度，考虑了自己的应对策略呢？</p>\n<p>今天，我就先来和你说一说RealNetworks公司在产品或市场遭遇商业巨鳄挤占或阻击时，所采取的应对举措。</p>\n", "video_width": 0, "column_could_sub": true, "article_ctime": 1507590000, "article_poster_wxlite": "https://static001.geekbang.org/render/screen/fd/cd/fd55ba81bd0e047e34cd5d5c9a537fcd.jpeg"}