{"video_id": "", "sku": "100001901", "video_cover": "", "author_name": "徐飞", "text_read_version": 0, "audio_size": 5806481, "article_cover": "https://static001.geekbang.org/resource/image/b9/ac/b96d47be82c61e9c78f7941d55e8a5ac.jpg", "product_type": "c1", "audio_url": "https://res001.geekbang.org/media/audio/77/f6/77119fc3a48eec41a703dc48fc56f1f6/ld.m3u8", "chapter_id": "0", "column_had_sub": true, "audio_dubber": "秭明", "is_finished": true, "neighbors": {"left": {"article_title": "001 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（上）", "id": 34}, "right": {"article_title": "003 | 以RealNetworks为例，谈谈初创公司如何应对巨头碾压", "id": 314}}, "product_id": 100001901, "video_height": 0, "rate_percent": 100, "article_content": "<p>上回聊到微软决定进军RealNetworks的市场，像之前痛击网景浏览器那样，通过免费加捆绑的方式对攻RealNetworks。文章末尾，我给你留了个问题。我虽然不知道你是怎么想的，但我相信你的想法一定很精彩。而格拉泽和RealNetworks面对这场战争，又是如何应对的呢？</p>\n<p>格拉泽的处境和当年网景公司有几分相似，而他也深知微软的强大。如果和微软正面冲突，面对财大气粗的竞争者，最后的结果只有一个，这一点在网景公司上已经呈现过一次，格拉泽肯定不希望自己和公司最后面临同样的下场。不过，大概因为格拉泽自己就是从微软走出来的，所以对于比尔 · 盖茨接下来会有怎样的套路很清楚。此外，格拉泽更深知自己的优势，以及微软不擅长的东西到底是什么。</p>\n<p>格拉泽的应对主要体现在两个方面。首先，他和PC制造商合作预装了RealPlayer，这种预先安装的播放器是免费的，这样就在很大程度上抵消了Windows的捆绑。当然，为此公司也牺牲了一部分的收入，不过这也是没办法的事：收费对免费，在哪个国家都会失败。其次，他开始多元化的扩张。</p>\n<!-- [[[read_end]]] -->\n<p>格拉泽很清楚微软做软件很厉害，但是软件以外的东西就不一定了。因此，在做播放器的同时，RealNetworks公司也开始转身成为内容服务商。RealNetworks给用户提供按月付费的歌曲播放和视频点播订阅服务。可以说今天大行其道的月租模式，是RealNetworks在应对微软的进攻时就想到的。</p>\n<p>RealNetworks就这样，成为了美国最早通过订阅服务向互联网用户收费的公司。与此同时，流媒体服务器的收入在下降，媒体订阅的收入却在上升。更重要的是，公司也开始做广告了，其形式有点类似于现在YouTube插播的广告。然而广告效果一般，这大概是公司做广告的时候用力过猛，大量的打广告，影响了用户体验。另外，大量的广告又导致播放器反应迟缓，经常出现卡顿等现象。这都说明RealNetworks进军广告市场的转型太过于激进了。但是不管怎么样，由于RealNetworks很早就开始进入订阅服务，因此它在播放器市场节节败退的情况下，在音频和视频服务市场上守住了战场，这让它安然度过了2000年网络泡沫以后艰难的几年。从这个角度看，格拉泽对于微软的套路和微软的软肋理解得极为深刻。</p>\n<p>扛住了微软进攻的RealNetworks马上要迎来一次更大的机遇和挑战，然而很遗憾，这一次格拉泽却没能抓住机遇。如果说格拉泽对微软的理解是深刻的，他对媒体发展大势的认识则是浅薄的。所以他和他的公司即将错失一次壮大的机会，未能避免从此一蹶不振的局势。</p>\n<p>命运女神让格拉泽手下一个叫托尼 · 法戴尔（Tony Fadell）的人敲开了格拉泽的大门，故事便从这里开始。现在，你知道法戴尔这个人非常有名，其中最有名的两个称号，一个是“iPod之父”，一个是Nest的创始人。而那时，订阅逐渐成为RealNetworks公司的盈利重点，并且帮助公司扛住了微软的进攻，法戴尔有了一个脑洞大开的想法：做一个硬件，它可以播放音乐，而且比市面上的MP3播放器容量都要大很多很多。这个播放器然后可以和RealNetworks的订阅服务结合起来，一定会大放异彩。</p>\n<p>然而很遗憾，格拉泽这个时候犯了一个致命的错误——拒绝了这个年轻人。于是法戴尔决定辞职，去寻求其他的支持。他辗转反侧地找来找去，最后终于找到了当时在垂死挣扎中寻找生机的苹果公司。</p>\n<p>苹果公司在1998年的时候股票跌到了1美元一股。创始人史蒂夫 · 乔布斯回到苹果做的第一件事情，就是去比尔 · 盖茨那边化缘。他和对方要了不少钱，卖了不少苹果股票。江湖传闻，比尔 · 盖茨投资苹果是因为：如果苹果破产，那么微软的视窗系统垄断就成真，微软就会立刻面临司法部的反垄断起诉。</p>\n<p>咱们回过头来接着说。法戴尔找上门时，事情进展也远不能说顺利。那时，苹果公司基本上还没做过消费者市场，而且公司处于缺钱的境地，乔布斯从理智的角度思考后，并不看好这款产品。但无论如何，这位苹果的创始人最后还是说了yes，雇用了法戴尔作为临时合同工一年，而正是在此期间，他们研发出了著名的iPod。</p>\n<p>接下来，iPod推出，然后很快就获得了巨大的成功。此时，苹果选择了和内容商一起推出订阅服务，当然它没有选择当时订阅领域的老大——RealNetworks。而至于为什么没有选择RealNetworks，相信你现在很容易理解了。接下来，凭借乔布斯在媒体领域的巨大影响力（顺便说一句，他还是迪士尼的大股东哦），苹果公司搞定了各大唱片公司，又推出了为它带来滚滚红利的iTunes。</p>\n<p>从此以后，整个唱片界的革命来了，而RealNetworks再也没有办法阻挡苹果的洪流。iTunes给苹果带来滚滚红利的时候，也大量地分流了RealNetworks的订阅量。格拉泽这个时候开始着急了，他决定放手一搏，推出了叫作Harmony的技术，可以让自己的合法音频在iPod上播放。这个技术本质上来讲就是黑进了iPod的版权系统，给RealNetworks卖的正版音乐套上一个iPod能理解的头儿，伪装成iTunes上面购买的东西。从技术角度上讲，这算得上是“伪正版”，游走于灰色地带。然而，这种做法并没有给公司带来起色，相反却引来了官司。</p>\n<p>在失去播放器市场和订阅服务之后，RealNetworks的日子显得更加艰难了。这个时候留给他们的最后的盈利点，无非是授权给各大公司的对RM和RMVB格式的解码技术。这项技术卖给了很多公司，包括高通的ARM芯片也支持对RM和RMVB进行硬解压。这就是国内的很多手机都支持硬解压RMVB格式的原因。</p>\n<p>而在2012年的时候，公司把自己的多项专利技术打包卖给了英特尔，同时它授权的最大客户高通，在2012年也决定停止继续授权付费。而在中国，2012年的时候小米手机也突然不支持解压RMVB了，当时还闹出了很多问题，其主要原因是那个时候互联网已经不再是RMVB格式的天下，而高通不再愿意花钱了。总而言之，通过专利授权赚钱的这条路，在2012年以后也随着专利的卖出不复存在了。RealNetworks的日子显得异常艰难，股票价格也一跌再跌。</p>\n<p>RealNetworks后来又尝试了若干次创新创业重启，然而世易时移，这世界已经不是当初的那个世界了。RealNetworks裁员又裁员，到后来在中国市场的招聘居然是只招合同工了。现在的RealNetworks在西雅图的办公室也越发得不起眼，新来西雅图的人大概已经不记得，西雅图曾经有一家占据互联网视频流媒体服务85%以上的伟大公司了。</p>\n<p>而话又说回来，RealNetworks其实还有另外一个机会，他们可以做一个YouTube或者买下YouTube。在那个时候作为订阅领域的老大，他们有钱有实力。然而不管因为什么样的原因，格拉泽始终没有抓住机会。后来，他接受采访的时候总是语焉不详的。我想格拉泽是聪明人，知道自己犯了错误，又接连犯了错误。然而，这世上终究是没有后悔药的。</p>\n<p>回过头去看，RealNetworks的领导人在互联网初期无疑是极具远见的，RealNetworks也的的确确改变了互联网的历史，创造性地引入了流媒体的概念。该公司因为是微软的资深员工创建的，对于微软可能的进攻很清楚，也非常清楚地知道微软不擅长什么，所以从播放器到内容订阅的转型，依然是非常正确而有远见的做法。不单如此，上天还给予了RealNetworks一个得天独厚的机会，iPod的原型是RealNetworks的一个员工想出来的。更甚者，当时RealNetworks具有领先世界的技术和内容服务，和远超苹果的现金流。假想下，如果iPod当时是被RealNetworks推出的话，西雅图的这家企业今天将会站在什么样的高度？</p>\n<p>而退一万步讲，RealNetworks已经知道插播广告了，如果它们推出了类似于YouTube的视频网站，也同样具有得天独厚的优势。然而没有然而了。在RealNetworks错过了这场最重要的转型战争，而且是在各方面都有利的情况下错过了这场战争之后，它的衰退就是没办法的事情了。现在想来，IT行业无疑是非常可怕的，一家伟大的公司因为错失了几次机会，就无可避免地衰退了。更重要的是，衰退后，很快就没有人再记得了。这无疑是个悲哀。</p>\n<p>一家IT企业可以一时领先，但是IT行业的风险如此之大，每家公司都是步履维艰，如果一步走错了，也许便不会再有第二次机会。回头看微软最近的转型，从搜索到社交再到移动，一步错步步错，值得庆幸的是，终于在云计算这一把上走对了。如果云计算也走错了，那么微软估计也会面临衰败的风险。</p>\n<p>RealNetworks最初的发展战略毫无问题，对于自己老东家的进攻策略和软肋理解得也非常深刻。然而，在最关键的时候，它错失了iPod，我们应该说是上天眷恋苹果呢，还是乔布斯确实就是神一样的存在，看到了格拉泽所不能看到的未来呢？</p>\n<p>必须相信的是，RealNetworks绝非一家小公司，其创始人格拉泽也绝对不是一个毫无远见的人。但是，我们依然看到了一个市值不到往日1%的残存的公司，缩在西雅图派克市场周围某栋楼的某一层里。看到这个结果，我的心里拔凉拔凉的。往者不可谏，来者犹可追，谁又敢说自己必然能够抓住未来的机会呢。在具备各种强烈优势背景的情况下，RealNetworks却一一败退，并沦落到如今籍籍无名的地步，你觉得是战略、创始人的眼界问题，还是大势已去呢？</p>\n<p></p>\n", "footer_cover_data": {"img_url": "https://static001.geekbang.org/resource/image/2d/8b/2de2db52ee03f508e0d240822f31808b.png", "link_url": "", "mp_url": ""}, "column_is_experience": false, "video_size": 0, "article_cover_hidden": false, "is_required": true, "rate": {"2": {"cur_version": 1574396676, "max_rate": 725, "cur_rate": 725, "is_finished": true, "total_rate": 725, "learned_seconds": 0}, "1": {"cur_version": 1546906713, "max_rate": 0, "cur_rate": 0, "is_finished": true, "total_rate": 0, "learned_seconds": 0}, "3": {"cur_version": 0, "max_rate": 0, "cur_rate": 0, "is_finished": false, "total_rate": 0, "learned_seconds": 0}}, "score": "1507586400123", "view_count": 8883, "audio_download_url": "https://static001.geekbang.org/resource/audio/77/f6/77119fc3a48eec41a703dc48fc56f1f6.mp3", "id": 39, "had_viewed": true, "article_title": "002 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（下）", "column_bgcolor": "#d1bd97", "like_count": 60, "had_liked": false, "is_video_preview": false, "article_summary": "上回讲到微软进军RealNetworks的市场，RealNetworks面对这场战争，又是如何应对的呢？", "article_features": 0, "article_could_preview": false, "column_cover": "https://static001.geekbang.org/resource/image/1a/5d/1a32306e4af4c76efdaed3f244136a5d.jpg", "audio_time_arr": {"m": "12", "s": "05", "h": "00"}, "column_id": 42, "audio_time": "00:12:05", "article_sharetitle": "西雅图IT公司之RealNetworks：一个帝国的兴衰（下）", "audio_title": "002-2 1", "audio_md5": "77119fc3a48eec41a703dc48fc56f1f6", "text_read_percent": 0, "article_subtitle": "无", "cid": 42, "video_time": "", "article_cshort": "<p>上回聊到微软决定进军RealNetworks的市场，像之前痛击网景浏览器那样，通过免费加捆绑的方式对攻RealNetworks。文章末尾，我给你留了个问题。我虽然不知道你是怎么想的，但我相信你的想法一定很精彩。而格拉泽和RealNetworks面对这场战争，又是如何应对的呢？</p>\n<p>格拉泽的处境和当年网景公司有几分相似，而他也深知微软的强大。如果和微软正面冲突，面对财大气粗的竞争者，最后的结果只有一个，这一点在网景公司上已经呈现过一次，格拉泽肯定不希望自己和公司最后面临同样的下场。不过，大概因为格拉泽自己就是从微软走出来的，所以对于比尔 · 盖茨接下来会有怎样的套路很清楚。此外，格拉泽更深知自己的优势，以及微软不擅长的东西到底是什么。</p>\n<p>格拉泽的应对主要体现在两个方面。首先，他和PC制造商合作预装了RealPlayer，这种预先安装的播放器是免费的，这样就在很大程度上抵消了Windows的捆绑。当然，为此公司也牺牲了一部分的收入，不过这也是没办法的事：收费对免费，在哪个国家都会失败。其次，他开始多元化的扩张。</p>\n", "video_width": 0, "column_could_sub": true, "article_ctime": 1507586400, "article_poster_wxlite": "https://static001.geekbang.org/render/screen/2c/ab/2c8f98629719b5451e6f0d71b57b96ab.jpeg"}