{"video_id": "", "sku": "100001901", "video_cover": "", "author_name": "徐飞", "text_read_version": 0, "audio_size": 5063440, "article_cover": "https://static001.geekbang.org/resource/image/d1/b5/d179d4e8c2b85406351a072d861dd2b5.jpg", "product_type": "c1", "audio_url": "https://res001.geekbang.org/media/audio/9f/07/9fc2791036d82b867eb869f34cfe2607/ld.m3u8", "chapter_id": "0", "column_had_sub": true, "audio_dubber": "秭明", "is_finished": true, "neighbors": {"left": {"article_title": "003 | 以RealNetworks为例，谈谈初创公司如何应对巨头碾压", "id": 314}, "right": {"article_title": "005 | 从Tableau上市，看学术界和工业界人士创业", "id": 473}}, "product_id": 100001901, "video_height": 0, "rate_percent": 100, "article_content": "<p>Tableau公司成立于2003年，总部位于西雅图，是全球领先的可视化分析软件的创建者，于2013年在纽约交易所上市。Tableau是这个领域的奠基人，并且在这个领域至今依然保持着全球最领先的研发态势。</p>\n<p>在数据变得越来越重要的时代，不管是具备精湛数据分析技能的从业人员，还是对数据分析一无所知的小白群体，可视化分析都被证明是一种非常行之有效的手段，并对各行各业都发挥着非常重要的作用。</p>\n<p>2003年，刚从斯坦福博士毕业的克里斯 · 斯托特（Chris Stolte）正值风华正茂的年纪，这之前的6年博士生涯，他一直在研究数据的可视化分析。</p>\n<p>斯托特师从帕特 · 汉拉汉（Pat Hanrahan）。而汉拉汉是世界著名的计算机图形学研究专家，在正式成为教授之前，是史蒂夫 · 乔布斯的3D动画制作公司皮克斯的早期员工，并在这家公司工作了3年（1986~1989年）。1989年，汉拉汉作为计算机图形学的教授加入普林斯顿大学，之后又在1995年转到了斯坦福大学。</p>\n<p>作为一个在计算机图形学方面卓有建树的学者，他敏锐地察觉到了数据可视化的前景，并认为将数据可视化用于辅助人进行数据分析这个研究方向，必会在未来产生巨大的影响。而当斯托特成为他的学生时，这也就顺理成章地成为了斯托特未来多年的研究方向。</p>\n<p>“花开两朵，各表一枝。”你可能知道，Tableau这家公司有三个创始人，其中两个已经登场，分别是后来的首席开发官斯托特以及他的导师——首席科学家汉拉汉，接下来该第三个创始人出场了，他就是公司CEO克里斯蒂安 · 夏伯特（Christian Chabot）。</p>\n<p>夏伯特先是在斯坦福这个校园里工作了几年，之后决定和他的本科校友兼老婆在斯坦福读硕士，然后他读了MBA，老婆则读了法学院。这一读就到了2000年，该毕业了。</p>\n<p>众所周知，2000年的时候美国发生了一次经济危机，当时互联网泡沫破灭，硅谷遍地惨淡之气。作为斯坦福MBA在这个点儿毕业，确实不是好时机。现在回想，我2009年毕业时的境遇，与此颇为相似。</p>\n<p>然而大家都是需要工作的，没有工作肯定是没办法活的。斯坦福MBA的胆量和我们比起来，肯定是大不一样：这个时候，夏伯特决定自己开公司了。</p>\n<p>他找到的合伙人正是斯托特和斯坦福的另外一个教授玛尼什 · 阿格拉瓦拉（Maneesh Agrawala）。没有人知道当初这几个人是怎样因缘际会走到一起的，也没有人知道为什么这家公司的合伙人教授是另外一个搞计算机图形学的大牛，而不是后来斯托特的导师汉拉汉。</p>\n<p>但无论如何，公司开起来了，工作也有了。夏伯特在经济危机以后毕业求职不果，决定自己干的励志故事也就这样诞生了。</p>\n<p><strong>更加有意思的是，夏伯特在若干年后的一次采访里面说，他们当初开这家公司设定的目标，就是把公司的技术做到一定规模，然后再把这家公司卖掉。</strong></p>\n<!-- [[[read_end]]] -->\n<p>这个买卖很成功，很快他们就拿到了美国在线和另外一个做地图数据的公司Vicinity的收购邀约。他们选择了后者，大概是因为钱比较多一些，而后者之后又被微软收购，那就是另一个故事了。</p>\n<p>我不知道是不是因为这次创业的成功，让夏伯特对下一次创业充满了期待。有关怎样使用数据可视化去帮助人们顺利地推进分析研究项目，斯托特和他的教授发表了一些论文，并且把做的东西整合进了一个叫作Polaris的系统。作为拿到基金资助的项目的一部分，这个系统本身是公开提供给大家使用的。</p>\n<p>关于为什么会萌发出创业的想法，已经不可考了。当时斯托特，加上他的导师，以及曾经和他一起创业的夏伯特，<strong>三个人决定基于Polaris这个系统进行商用化开发，并创建一家新的公司。这家公司就是现在鼎鼎大名的Tableau。</strong></p>\n<p>Tableau在2003年1月创建于加州的山景城。大约10个月以后，公司的创始人们决定把公司总部从硅谷搬迁到西雅图。至于这背后的原因，后来有人问过他们，而创始人的回答是：这个地方更适合创业。</p>\n<p>我们今天估计很难理解为什么。但是如果你知道当初微软在西雅图最为鼎盛的时候，其一家公司的市值，就超过硅谷很多大公司的市值总和的时候，就多少能理解一二了：在那个年代里，西雅图在引领IT业的发展。当然，现在看来这种引领其实也是盛极而衰的最后辉煌阶段。</p>\n<p><strong>而很有意思的是，Tableau这个软件，从斯托特开发第一个版本的时候，就构建在微软的开发环境下，地地道道是一个Windows平台上的软件</strong>。这一状态持续了很久，大约是直到Tableau上市一年以后，2014年的夏天，Tableau 8.2版本才开始正式支持Mac。而Tableau对于Linux的支持，直至今天公司依然在努力，但是还没有正式的版本出来。</p>\n<p><strong>此外，从公司的氛围上来讲，Tableau也是一家非常微软化的公司</strong>。我作为一个微软开发人员，进到这家公司来，基本上没有任何学习的难度，第一天就可以顺利地进行开发。Tableau公司所使用的工具，和微软内部的开发工具相差无几。我想这一方面与项目最初诞生的时候，就全面使用了微软的工具有关，一方面也表明了微软这个软件帝国对本地生态圈的巨大影响。</p>\n<p><strong>Tableau的发展，从技术角度上来讲，有几个非常重要的关键点。</strong></p>\n<p><strong>首先是Tableau 1.0的成功发布。Tableau 1.0是从Polaris到一个成熟可用的商业软件的变迁</strong>。斯托特后来在回忆的时候说，他没有预想到需要一年的时间去修修补补，把很多的细节部分做好：一个商业软件和一个学校里面的科研软件差别是巨大的。然而，Tableau 1.0虽然在可视化分析方面已经表现得非常优秀，但是对各种数据源的支持、对各种计算函数的支持等其他方面，却不尽如人意。当然，1.0版本也从未卖出过多少钱。</p>\n<p><strong>严格意义上讲，两年以后发布的Tableau 2.0，才是Tableau历史上第一个真正可以商用的软件</strong>。而2.0的时候，Tableau也终于开始接到可观的订单。除去早期招到的几个能力很强的开发人员以外，销售队伍也开始建立起来。法律相关的人员也慢慢就位了。</p>\n<p><strong>2007年的Tableau 3.0是具有里程碑意义的一次发布。这次Tableau增加了一个产品——Tableau服务器</strong>。这个服务器尽管当初很简陋，但却使一个企业里面协同进行数据分析和共享数据分析的结果成为了可能。Tableau服务器的盈利能力很快就超过了Tableau本身。</p>\n<p><strong>Tableau的下一个里程碑式的发布，是三年后的Tableau 6.0，其中引入了后来称为Tableau数据引擎的新组件</strong>。这个组件实际上是Tableau自己开发的一个列式数据处理引擎，专门针对Tableau自己的应用优化过。这个引擎的到来让Tableau在数据处理能力上，终于迈上了一个新台阶。</p>\n<p>从此以后，Tableau除了可以直连到各种数据源以外，还可以对数据源取一个镜像，把数据导进Tableau数据引擎里面，在本地进行分析，这大大加快了分析的速度。</p>\n<p>更重要的是，因为这个引擎的引入，使得Tableau对非关系型数据库的支持都成为了可能，比如说对文本文件的支持，对Excel电子表格的支持，以及后来对PDF文件的支持等。只要Tableau可以把这些数据通过数据清理导进引擎，就可以进行有效地分析。数据引擎对Tableau的发展可谓至关重要。</p>\n<p>Tableau此后的各个版本主要是围绕数据引擎的各种提高，以及对各种企业级应用的支持来提升。一直到上市以前，Tableau都没有再引入任何关键性的功能。下一次关键性功能的引入，便是2014年6月份对Mac的支持了。</p>\n<p><strong>Tableau于2013年正式在纽约交易所交易，股票代码为DATA</strong>。这个名字取得非常好，因为DATA既好记，又反映了公司最主要的服务市场。上市以后，Tableau开始了在各个领域的全面扩张，从云到ETL，从企业级服务到数据引擎，这种扩张使Tableau的开发人员迅速从不到200个扩充到了近1000个。</p>\n<p><strong>与此同时，因为外界的看好、股市的飙升，竞争对手，尤其是大鳄们，终于开始把眼光转向了这个市场</strong>。结果就是微软举着PowerBI的大旗大举进军这个市场，以其低廉的价格和大量的开发人员投入，迅速推出新版本。这无疑对Tableau造成了致命的打击，其股价在2016年初的财报后，一天之内发生“腰斩”。</p>\n<p>这是Tableau迅猛发展史上一次巨大的打击。之后公司采取了很多应对措施，其中最为重要的是CEO和其他创始人退出，并从亚马逊的AWS请来了新的CEO亚当 · 塞利普斯凯（Adam Selipsky）。在新CEO的带领下，经过近一年的努力，销售和研发终于都稳定下来，股价也渐渐回升到了“腰斩”前的状态。</p>\n<p>今天我带你回顾了Tableau这家公司的整个发展历史。在Tableau的发展历程中，有一些值得你我去深思的问题。我们都知道，要想在今天竞争激烈的环境下创业，一个好的想法很重要。而在学术圈里面的人，很多时候不缺有趣的想法，很多时候甚至以研究系统的形式得以实现。</p>\n<p>然而斯托特自己也说过，他并没有想到需要那么久的时间，去填补一个研究系统和一个商业软件之间的差距。那么学术界研究项目的商业化，到底会遇到哪些拦路虎呢？学术界出身的人，和工业界出来的人走创业这条路，其优势和劣势到底在哪里呢？</p>\n<p></p>\n", "footer_cover_data": {"img_url": "https://static001.geekbang.org/resource/image/2d/8b/2de2db52ee03f508e0d240822f31808b.png", "link_url": "", "mp_url": ""}, "column_is_experience": false, "video_size": 0, "article_cover_hidden": false, "is_required": true, "rate": {"2": {"cur_version": 1574396676, "max_rate": 632, "cur_rate": 632, "is_finished": true, "total_rate": 632, "learned_seconds": 0}, "1": {"cur_version": 1546958472, "max_rate": 0, "cur_rate": 0, "is_finished": true, "total_rate": 0, "learned_seconds": 0}, "3": {"cur_version": 0, "max_rate": 0, "cur_rate": 0, "is_finished": false, "total_rate": 0, "learned_seconds": 0}}, "score": "1507676400123", "view_count": 7874, "audio_download_url": "https://static001.geekbang.org/resource/audio/9f/07/9fc2791036d82b867eb869f34cfe2607.mp3", "id": 415, "had_viewed": true, "article_title": "004 | 可视化分析鼻祖Tableau", "column_bgcolor": "#d1bd97", "like_count": 31, "had_liked": false, "is_video_preview": false, "article_summary": "Tableau作为可视化分析软件领域的奠基人，算是学术界人士创业成功的典范，今天就来看一看其成长的历程。", "article_features": 0, "article_could_preview": false, "column_cover": "https://static001.geekbang.org/resource/image/1a/5d/1a32306e4af4c76efdaed3f244136a5d.jpg", "audio_time_arr": {"m": "10", "s": "32", "h": "00"}, "column_id": 42, "audio_time": "00:10:32", "article_sharetitle": "可视化分析鼻祖Tableau：一个学术界创业的故事", "audio_title": "009 1", "audio_md5": "9fc2791036d82b867eb869f34cfe2607", "text_read_percent": 0, "article_subtitle": "无", "cid": 42, "video_time": "", "article_cshort": "<p>Tableau公司成立于2003年，总部位于西雅图，是全球领先的可视化分析软件的创建者，于2013年在纽约交易所上市。Tableau是这个领域的奠基人，并且在这个领域至今依然保持着全球最领先的研发态势。</p>\n<p>在数据变得越来越重要的时代，不管是具备精湛数据分析技能的从业人员，还是对数据分析一无所知的小白群体，可视化分析都被证明是一种非常行之有效的手段，并对各行各业都发挥着非常重要的作用。</p>\n<p>2003年，刚从斯坦福博士毕业的克里斯 · 斯托特（Chris Stolte）正值风华正茂的年纪，这之前的6年博士生涯，他一直在研究数据的可视化分析。</p>\n<p>斯托特师从帕特 · 汉拉汉（Pat Hanrahan）。而汉拉汉是世界著名的计算机图形学研究专家，在正式成为教授之前，是史蒂夫 · 乔布斯的3D动画制作公司皮克斯的早期员工，并在这家公司工作了3年（1986~1989年）。1989年，汉拉汉作为计算机图形学的教授加入普林斯顿大学，之后又在1995年转到了斯坦福大学。</p>\n<p>作为一个在计算机图形学方面卓有建树的学者，他敏锐地察觉到了数据可视化的前景，并认为将数据可视化用于辅助人进行数据分析这个研究方向，必会在未来产生巨大的影响。而当斯托特成为他的学生时，这也就顺理成章地成为了斯托特未来多年的研究方向。</p>\n<p>“花开两朵，各表一枝。”你可能知道，Tableau这家公司有三个创始人，其中两个已经登场，分别是后来的首席开发官斯托特以及他的导师——首席科学家汉拉汉，接下来该第三个创始人出场了，他就是公司CEO克里斯蒂安 · 夏伯特（Christian Chabot）。</p>\n<p>夏伯特先是在斯坦福这个校园里工作了几年，之后决定和他的本科校友兼老婆在斯坦福读硕士，然后他读了MBA，老婆则读了法学院。这一读就到了2000年，该毕业了。</p>\n<p>众所周知，2000年的时候美国发生了一次经济危机，当时互联网泡沫破灭，硅谷遍地惨淡之气。作为斯坦福MBA在这个点儿毕业，确实不是好时机。现在回想，我2009年毕业时的境遇，与此颇为相似。</p>\n<p>然而大家都是需要工作的，没有工作肯定是没办法活的。斯坦福MBA的胆量和我们比起来，肯定是大不一样：这个时候，夏伯特决定自己开公司了。</p>\n<p>他找到的合伙人正是斯托特和斯坦福的另外一个教授玛尼什 · 阿格拉瓦拉（Maneesh Agrawala）。没有人知道当初这几个人是怎样因缘际会走到一起的，也没有人知道为什么这家公司的合伙人教授是另外一个搞计算机图形学的大牛，而不是后来斯托特的导师汉拉汉。</p>\n<p>但无论如何，公司开起来了，工作也有了。夏伯特在经济危机以后毕业求职不果，决定自己干的励志故事也就这样诞生了。</p>\n<p><strong>更加有意思的是，夏伯特在若干年后的一次采访里面说，他们当初开这家公司设定的目标，就是把公司的技术做到一定规模，然后再把这家公司卖掉。</strong></p>\n", "video_width": 0, "column_could_sub": true, "article_ctime": 1507676400, "article_poster_wxlite": "https://static001.geekbang.org/render/screen/cc/4e/cc279ea097fba1739decc3df0e33dc4e.jpeg"}